// This file is part of ProjectDungeon
// Copyright (C) 2026 Life4gal <life4gal@gmail.com>
// This file is subject to the license terms in the LICENSE file
// found in the top-level directory of this distribution.

#pragma once

#include <cstdint>

namespace pd
{
	// 实体类型
	// 这些值会用做碰撞检测过滤,小心设置!
	enum class EntityType : std::uint64_t
	{
		// NONE = 0b0000'0000'0000'0000'0000'0000'0000'0000'0000'0000'0000'0000'0000'0000'0000'0000,

		// [0~7]

		// 地板
		FLOOR = 0b0000'0001,

		// [8~15]

		// 墙壁
		WALL = 0b0000'0001'0000'0000,
		// 墙壁装饰物(叠加在墙壁上)
		WALL_DECORATION = 0b0000'0010'0000'0000,
		// 门
		DOOR = 0b0000'0100'0000'0000,

		// [16~23]

		// 地板装饰物(不影响移动, 感应器)
		FLOOR_DECORATION = 0b0000'0001'0000'0000'0000'0000,
		// 地板洞(阻止地面移动,但是可以飞过)
		FLOOR_HOLE = 0b0000'0010'0000'0000'0000'0000,
		// 矮地形(阻止地面移动,但是可以飞过)
		LOW_TERRAIN = 0b0000'0100'0000'0000'0000'0000,
		// 高地形(阻止地面移动,不能飞过)
		HIGH_TERRAIN = 0b0000'1000'0000'0000'0000'0000,

		// [24~31]

		// 敌人
		ENEMY = 0b0000'0001'0000'0000'0000'0000'0000'0000,
		// 玩家
		PLAYER = 0b0000'0010'0000'0000'0000'0000'0000'0000,

		// [32~39]

		// 近战武器
		WEAPON = 0b0000'0001'0000'0000'0000'0000'0000'0000'0000'0000,
		// 飞弹
		PROJECTILE = 0b0000'0010'0000'0000'0000'0000'0000'0000'0000'0000,

		// [40~47]

		// 特效
		EFFECT = 0b0000'0001'0000'0000'0000'0000'0000'0000'0000'0000'0000'0000,

		// [48~55]

		// [56~63]

		MASK = 0b1111'1111'1111'1111'1111'1111'1111'1111'1111'1111'1111'1111'1111'1111'1111'1111
	};
}
